comp-sci/theorem-provers/mizar/linear-algebra.org
#+TITLE: Linear Algebra Rosetta Stone
#+AUTHOR: Alex Nelson
#+EMAIL: pqnelson@gmail.com
#+DATE: <2023-11-19T07:32:53-08:00>
#+LANGUAGE: en
#+OPTIONS: H:nil toc:nil num:nil
#+HTML_DOCTYPE: html5
#+INCLUDE: ../../../org-macros.org
#+HTML_LINK_UP: ./index.html
#+HTML_LINK_HOME: ../../../index.html
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="../../../css/stylesheet.css" />
# Created Sunday November 19, 2023 at  7:32AM

* Introduction
:PROPERTIES:
:CUSTOM_ID: h-3799b2d3-78b9-435b-850b-60b7e94db637
:END:

This is a Rosetta stone of the results as found in Axler's
{{{book-title(Linear Algebra Done Right)}}}.

* Chapter 1 Vector Spaces
:PROPERTIES:
:CUSTOM_ID: h-542e3e45-efca-42f4-bf1b-c5e8654ae7c3
:END:

** 1A. $\mathbb{R}^{n}$ and  $\mathbb{C}^{n}$
:PROPERTIES:
:CUSTOM_ID: h-820f20b0-6ac6-4596-be2b-e0394aa079e8
:END:

*** Complex Numbers
:PROPERTIES:
:CUSTOM_ID: h-b8342424-741a-4311-8595-c87ad897143d
:END:

- *Definition 1.1* (complex numbers, $\mathbb{C}$)
  - A {{{dfn(Complex Number)}}} is an ordered pair $(a,b)$ where
    $a,b\in\mathbb{R}$. We write this as $a + \mathrm{i}b$.
    - In Mizar, instead of working with the Cartesian product
      $\mathbb{R}\times\mathbb{R}$, we use the product of an indexed
      family with two members $X_{0}=\mathbb{R}$ and
      $X_{1}=\mathbb{R}$. This is equivalent to the set
      $z\in\hom(\{0,1\},\mathbb{R})\iff z\in\prod_{\alpha=0,1}X_{\alpha}$ 
      and this is precisely how Mizar defines complex numbers.
    - Since this is kind of confusing, there is also the notation
      ~[*a,b*]~ for the complex number $a+\mathrm{i}b$ which is defined
      in [[https://mizar.uwb.edu.pl/version/current/html/arytm_0.html#K5][~ARYTM_0:def 5~]].
    - Note that Mizar follows mathematical practice, and sets
      $\mathbb{C}=\{(a,b)\in\mathbb{R}^{2}\mid b\neq0\}\cup\mathbb{R}$
      so that $\mathbb{R}\subset\mathbb{C}$ is true.
  - The set of all complex numbers is denoted by
    $\mathbb{C} = \{a+\mathrm{i}b\mid a,b\in\mathbb{R}\}$.
    - In Mizar, this is denoted [[https://mizar.uwb.edu.pl/version/current/html/numbers.html#K2][~COMPLEX~]] (and defined in ~NUMBERS:def 2~)
  - Addition and multiplication in $\mathbb{C}$ are defined as:
    $(a + \mathrm{i}b)+(c+\mathrm{i}d) = (a+c)+\mathrm{i}(b+d)$
    $(a + \mathrm{i}b)(c+\mathrm{i}d) = (ac-bd)+\mathrm{i}(ad+bc)$
    - [[https://mizar.uwb.edu.pl/version/current/html/xcmplx_0.html#K2][~XCMPLX_0:def 3~]] defines addition of complex numbers
    - [[https://mizar.uwb.edu.pl/version/current/html/xcmplx_0.html#K3][~XCMPLX_0:def 4~]] defines multiplication of complex numbers
- The choice of $\mathrm{i}=(0,1)$ is due to Euler, and it is encoded in
  Mizar as ~<i>~ as defined in [[https://mizar.uwb.edu.pl/version/current/html/xcmplx_0.html#K1][~XCMPLEX_0:def 1~]]
- *Theorem 1.3.* Properties of Complex Arithmetic
  - Addition and multiplication are both commutative
    - This is built into the definition
  - Addition is associative ([[https://mizar.uwb.edu.pl/version/current/html/xcmplx_1.html#1][~XCMPLX_1:1~]])
  - Multiplication is associative ([[https://mizar.uwb.edu.pl/version/current/html/xcmplx_1.html#T4][~XCMPLX_1:4~]])
  - 0 is the additive identity & 1 is the multiplicative identity (this
    is true thanks to using the real numbers)
  - Every $\alpha\in\mathbb{C}$ has a unique $\beta\in\mathbb{C}$ such
    that $\alpha+\beta=0$
    - This is negation, and defined in [[https://mizar.uwb.edu.pl/version/current/html/xcmplx_0.html#K4][~XCMPLX_0:def 5~]]
  - Every $\alpha\in\mathbb{C}$ has a unique $\beta\in\mathbb{C}$ such
    that $\alpha\beta=1$
    - This is inversion and defined in [[https://mizar.uwb.edu.pl/version/current/html/xcmplx_0.html#K5][~XCMPLX_0:def 6~]]
  - Distributivity $\lambda(\alpha+\beta)=\lambda\alpha + \lambda\beta$
    for every $\alpha,\beta,\lambda\in\mathbb{C}$
- *Definition 1.5.*
  - Subtraction is defined as $\alpha-\beta=\alpha+(-\beta)$ ([[https://mizar.uwb.edu.pl/version/current/html/xcmplx_0.html#K6][~XCMPLX_0:def 7~]])
  - Division is defined as multiplying by the inverse of the denominator
    $\alpha/\beta=\alpha\cdot\beta^{-1}$
    ([[https://mizar.uwb.edu.pl/version/current/html/xcmplx_0.html#K7][~XCMPLX_0:def 8~]])
- *Convention:* throughout the book, $\mathbb{F}$ to stand for either
  $\mathbb{R}$ or $\mathbb{C}$.
  
*** Lists
:PROPERTIES:
:CUSTOM_ID: h-f7ee189a-7ae4-4f51-b4ea-b79c32998363
:END:

- *Aside:* Mathematicians informally talk about lists and $n$
  tuples. This is formalized in Mizar using finite sequences in the
  ~FINSEQ~ series of articles.
- *Definition 1.8.*
  - Let $n$ be a non-negative integer. A {{{dfn(List)}}} of length $n$ is
    an ordered collection of $n$ elements.
    - This is precisely formalized as a [[https://mizar.uwb.edu.pl/version/current/html/finseq_1.html#NM1][~FinSequence~]] in Mizar, which is
      a function whose domain is $\{1,2,\dots,n\}$
    - We can also use the Mizar definition
      [[https://mizar.uwb.edu.pl/version/current/html/finseq_2.html#K4][~n-tuples_on F~]] to refer to the set of all $n$ tuples
      (i.e., ~FinSequence~ of length $n$) with entries in $F$
  - Two lists are equal if and only if they have the same elements in
    the same order.
    - This is precisely [[https://mizar.uwb.edu.pl/version/current/html/finseq_1.html#D17][~FINSEQ_1:def 17~]]

