docs/comp-sci/theorem-provers/mizar/linear-algebra.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Linear Algebra Rosetta Stone</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../../../css/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Linear Algebra Rosetta Stone</h1>

<div id="outline-container-h-3799b2d3-78b9-435b-850b-60b7e94db637" class="outline-2">
<h2 id="h-3799b2d3-78b9-435b-850b-60b7e94db637">Introduction</h2>
<div class="outline-text-2" id="text-h-3799b2d3-78b9-435b-850b-60b7e94db637">
<p>
This is a Rosetta stone of the results as found in Axler's
<cite class="book-title">Linear Algebra Done Right</cite>.
</p>
</div>
</div>

<div id="outline-container-h-542e3e45-efca-42f4-bf1b-c5e8654ae7c3" class="outline-2">
<h2 id="h-542e3e45-efca-42f4-bf1b-c5e8654ae7c3">Chapter 1 Vector Spaces</h2>
<div class="outline-text-2" id="text-h-542e3e45-efca-42f4-bf1b-c5e8654ae7c3">
</div>

<div id="outline-container-h-820f20b0-6ac6-4596-be2b-e0394aa079e8" class="outline-3">
<h3 id="h-820f20b0-6ac6-4596-be2b-e0394aa079e8">1A. \(\mathbb{R}^{n}\) and  \(\mathbb{C}^{n}\)</h3>
<div class="outline-text-3" id="text-h-820f20b0-6ac6-4596-be2b-e0394aa079e8">
</div>

<div id="outline-container-h-b8342424-741a-4311-8595-c87ad897143d" class="outline-4">
<h4 id="h-b8342424-741a-4311-8595-c87ad897143d">Complex Numbers</h4>
<div class="outline-text-4" id="text-h-b8342424-741a-4311-8595-c87ad897143d">
<ul class="org-ul">
<li><b>Definition 1.1</b> (complex numbers, \(\mathbb{C}\))
<ul class="org-ul">
<li>A <dfn>Complex Number</dfn> is an ordered pair \((a,b)\) where
\(a,b\in\mathbb{R}\). We write this as \(a + \mathrm{i}b\).
<ul class="org-ul">
<li>In Mizar, instead of working with the Cartesian product
\(\mathbb{R}\times\mathbb{R}\), we use the product of an indexed
family with two members \(X_{0}=\mathbb{R}\) and
\(X_{1}=\mathbb{R}\). This is equivalent to the set
\(z\in\hom(\{0,1\},\mathbb{R})\iff z\in\prod_{\alpha=0,1}X_{\alpha}\) 
and this is precisely how Mizar defines complex numbers.</li>
<li>Since this is kind of confusing, there is also the notation
<code>[*a,b*]</code> for the complex number \(a+\mathrm{i}b\) which is defined
in <a href="https://mizar.uwb.edu.pl/version/current/html/arytm_0.html#K5"><code>ARYTM_0:def 5</code></a>.</li>
<li>Note that Mizar follows mathematical practice, and sets
\(\mathbb{C}=\{(a,b)\in\mathbb{R}^{2}\mid b\neq0\}\cup\mathbb{R}\)
so that \(\mathbb{R}\subset\mathbb{C}\) is true.</li>
</ul></li>
<li>The set of all complex numbers is denoted by
\(\mathbb{C} = \{a+\mathrm{i}b\mid a,b\in\mathbb{R}\}\).
<ul class="org-ul">
<li>In Mizar, this is denoted <a href="https://mizar.uwb.edu.pl/version/current/html/numbers.html#K2"><code>COMPLEX</code></a> (and defined in <code>NUMBERS:def 2</code>)</li>
</ul></li>
<li>Addition and multiplication in \(\mathbb{C}\) are defined as:
\((a + \mathrm{i}b)+(c+\mathrm{i}d) = (a+c)+\mathrm{i}(b+d)\)
\((a + \mathrm{i}b)(c+\mathrm{i}d) = (ac-bd)+\mathrm{i}(ad+bc)\)
<ul class="org-ul">
<li><a href="https://mizar.uwb.edu.pl/version/current/html/xcmplx_0.html#K2"><code>XCMPLX_0:def 3</code></a> defines addition of complex numbers</li>
<li><a href="https://mizar.uwb.edu.pl/version/current/html/xcmplx_0.html#K3"><code>XCMPLX_0:def 4</code></a> defines multiplication of complex numbers</li>
</ul></li>
</ul></li>
<li>The choice of \(\mathrm{i}=(0,1)\) is due to Euler, and it is encoded in
Mizar as <code>&lt;i&gt;</code> as defined in <a href="https://mizar.uwb.edu.pl/version/current/html/xcmplx_0.html#K1"><code>XCMPLEX_0:def 1</code></a></li>
<li><b>Theorem 1.3.</b> Properties of Complex Arithmetic
<ul class="org-ul">
<li>Addition and multiplication are both commutative
<ul class="org-ul">
<li>This is built into the definition</li>
</ul></li>
<li>Addition is associative (<a href="https://mizar.uwb.edu.pl/version/current/html/xcmplx_1.html#1"><code>XCMPLX_1:1</code></a>)</li>
<li>Multiplication is associative (<a href="https://mizar.uwb.edu.pl/version/current/html/xcmplx_1.html#T4"><code>XCMPLX_1:4</code></a>)</li>
<li>0 is the additive identity &amp; 1 is the multiplicative identity (this
is true thanks to using the real numbers)</li>
<li>Every \(\alpha\in\mathbb{C}\) has a unique \(\beta\in\mathbb{C}\) such
that \(\alpha+\beta=0\)
<ul class="org-ul">
<li>This is negation, and defined in <a href="https://mizar.uwb.edu.pl/version/current/html/xcmplx_0.html#K4"><code>XCMPLX_0:def 5</code></a></li>
</ul></li>
<li>Every \(\alpha\in\mathbb{C}\) has a unique \(\beta\in\mathbb{C}\) such
that \(\alpha\beta=1\)
<ul class="org-ul">
<li>This is inversion and defined in <a href="https://mizar.uwb.edu.pl/version/current/html/xcmplx_0.html#K5"><code>XCMPLX_0:def 6</code></a></li>
</ul></li>
<li>Distributivity \(\lambda(\alpha+\beta)=\lambda\alpha + \lambda\beta\)
for every \(\alpha,\beta,\lambda\in\mathbb{C}\)</li>
</ul></li>
<li><b>Definition 1.5.</b>
<ul class="org-ul">
<li>Subtraction is defined as \(\alpha-\beta=\alpha+(-\beta)\) (<a href="https://mizar.uwb.edu.pl/version/current/html/xcmplx_0.html#K6"><code>XCMPLX_0:def 7</code></a>)</li>
<li>Division is defined as multiplying by the inverse of the denominator
\(\alpha/\beta=\alpha\cdot\beta^{-1}\)
(<a href="https://mizar.uwb.edu.pl/version/current/html/xcmplx_0.html#K7"><code>XCMPLX_0:def 8</code></a>)</li>
</ul></li>
<li><b>Convention:</b> throughout the book, \(\mathbb{F}\) to stand for either
\(\mathbb{R}\) or \(\mathbb{C}\).</li>
</ul>
</div>
</div>

<div id="outline-container-h-f7ee189a-7ae4-4f51-b4ea-b79c32998363" class="outline-4">
<h4 id="h-f7ee189a-7ae4-4f51-b4ea-b79c32998363">Lists</h4>
<div class="outline-text-4" id="text-h-f7ee189a-7ae4-4f51-b4ea-b79c32998363">
<ul class="org-ul">
<li><b>Aside:</b> Mathematicians informally talk about lists and \(n\)
tuples. This is formalized in Mizar using finite sequences in the
<code>FINSEQ</code> series of articles.</li>
<li><b>Definition 1.8.</b>
<ul class="org-ul">
<li>Let \(n\) be a non-negative integer. A <dfn>List</dfn> of length \(n\) is
an ordered collection of \(n\) elements.
<ul class="org-ul">
<li>This is precisely formalized as a <a href="https://mizar.uwb.edu.pl/version/current/html/finseq_1.html#NM1"><code>FinSequence</code></a> in Mizar, which is
a function whose domain is \(\{1,2,\dots,n\}\)</li>
<li>We can also use the Mizar definition
<a href="https://mizar.uwb.edu.pl/version/current/html/finseq_2.html#K4"><code>n-tuples_on F</code></a> to refer to the set of all \(n\) tuples
(i.e., <code>FinSequence</code> of length \(n\)) with entries in \(F\)</li>
</ul></li>
<li>Two lists are equal if and only if they have the same elements in
the same order.
<ul class="org-ul">
<li>This is precisely <a href="https://mizar.uwb.edu.pl/version/current/html/finseq_1.html#D17"><code>FINSEQ_1:def 17</code></a></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
