comp-sci/theorem-provers/mizar/linear-algebra.org
*** $\mathbb{F}^{n}$
:PROPERTIES:
:CUSTOM_ID: h-0fca0004-528d-4dea-9959-1f1f77350df5
:END:

- *Definition 1.11.*
  - $\mathbb{F}^{n}$ denotes the set of all lists of
    length $n$ of elements of $\mathbb{F}$
    - In Mizar, this could be formalized as ~Funcs(Seg n,COMPLEX)~ or
      ~Funcs(Seg n,REAL)~
  - If $(x_{1},\dots,x_{n})\in\mathbb{F}^{n}$ and $k\in\{1,\dots,n\}$,
    then $x_{k}$ is the $k^{\text{th}}$ coordinate of $x$.
    - In Mizar, this is denoted ~x.k~
- *Definition 1.13.*
  Addition in $\mathbb{F}^{n}$ is defined componentwise
  $(x_{1},\dots,x_{n})+(y_{1},\dots,y_{n})=(x_{1}+y_{1},\dots,x_{n}+y_{n})$.
  - This is formalized in [[https://mizar.uwb.edu.pl/version/current/html/fvsum_1.html#K3][~FVSUM_1:def 3~]].
- *Theorem 1.14* (Commutativity of addition in $\mathbb{F}^{n}$).
  If $x,y\in\mathbb{F}^{n}$, then $x+y=y+x$.
  - This is automatic with the registrations of ~FVSUM_1~
- *Notation 1.15* (0).
  It's common to denote by 0 the list of length $n$ whose entries are
  all zero.
  - In Mizar, we can denote this by ~(n |-> 0)~ using [[https://mizar.uwb.edu.pl/version/current/html/finseq_2.html#K5][~FINSEQ_2:def 2~]]
- *Definition 1.17* (Additive inverse on $\mathbb{F}^{n}$).
  For $x\in\mathbb{F}^{n}$, the {{{dfn(Additive Inverse)}}} of $x$,
  denoted $-x$, is the element $-x\in\mathbb{F}^{n}$ such that
  $x+(-x)=0$.
  - This is definition [[https://mizar.uwb.edu.pl/version/current/html/fvsum_1.html#K5][~FVSUM_1:def 4~]] 
- *Definition 1.18* (Scalar multiplication on $\mathbb{F}^{n}$).
  The {{{dfn(Product)}}} of a number $\lambda\in\mathbb{F}$ and a vector $x=(x_{1},\dots,x_{n})\in\mathbb{F}^{n}$
  is the vector obtained by multiplying componentwise by $\lambda$:
  $\lambda x=(\lambda x_{1},\dots,\lambda x_{n})$.
  - This is definition [[https://mizar.uwb.edu.pl/version/current/html/fvsum_1.html#K9][~FVSUM_1:def 6~]]

*** Digression on Fields
:PROPERTIES:
:CUSTOM_ID: h-1f8560be-d80c-49e5-94e2-f55d13dcb275
:END:

Axler gives a brief digression about fields. I will take this
opportunity to discuss Mizar's formalization ~Field~ of fields.

Introductory linear algebra courses give the uninspiring definition of a
field as something along the lines of:

- *Implicit Definition.* A {{{dfn(Field)}}} consists of a set
  $\mathbb{F}$ equipped with
  - addition $+\colon\mathbb{F}\times\mathbb{F}\to\mathbb{F}$
  - negation $-\colon\mathbb{F}\to\mathbb{F}$
  - a constant $0\in\mathbb{F}$
  - multiplication $\,\cdot\,\colon\mathbb{F}\times\mathbb{F}\to\mathbb{F}$
  - inversion $(-)^{-1}\colon\mathbb{F}\to\mathbb{F}$ (Mizar denoted $x^{-1}$ as ~x"~)
  - a constant $1\in\mathbb{F}$

  such that

  - addition is commutative $x+y=y+x$ ([[https://mizar.uwb.edu.pl/version/current/html/rlvect_1.html#V2][~Abelian~]])
  - addition is associative $x+(y+z)=(x+y)+z$ ([[https://mizar.uwb.edu.pl/version/current/html/rlvect_1.html#V3][~add-associative~]])
  - zero is unit for addition: $x+0=x$ ([[https://mizar.uwb.edu.pl/version/current/html/rlvect_1.html#V4][~right_zeroed~]]) and as a
    consequence of commutativity $0+x=x$
  - negation gives additive inverse $x+(-x)=0$ ([[https://mizar.uwb.edu.pl/version/current/html/algstr_0.html#V10][~right_complementable~]])
  - multiplication is commutative $xy=yx$ ([[https://mizar.uwb.edu.pl/version/current/html/group_1.html#V5][~commutative~]])
  - multiplication is associative $(xy)z=x(yz)$ ([[https://mizar.uwb.edu.pl/version/current/html/group_1.html#V3][~associative~]])
  - one is the unit for multiplication $1\cdot x=x\cdot 1=x$ ([[https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#V4][~well-unital~]])
  - inversion is the multiplicative inverse when $x\neq0$,
    $x^{-1}\cdot x=1$ ([[https://mizar.uwb.edu.pl/version/current/html/algstr_0.html#V33][~almost_left_invertible~]] = all nonzero elements are
    [[https://mizar.uwb.edu.pl/version/current/html/algstr_0.html#V23][~left_invertible~]]) and then commutativity gives us $x\cdot x^{-1}=1$
  - multiplication distributes over addition: $x(y+z)=xy+xz$ ([[https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#V5][~distributive~]])

Later on, students learn there is a hierarchy of generalizations of
fields (rings and things).

Idiomatic Mizar defines a structure, then attaches adjectives to it to
form a mathematical gadget. The underlying structure for fields
coincides with rings (and things), and is formalize as [[https://mizar.uwb.edu.pl/version/current/html/algstr_0.html#L6][~doubleLoopStr~]]
in Mizar.

#+begin_remark
To American university students, this is an odd choice of
name, but most of abstract algebra has only been standardized fairly
recently --- it is not uncommon to find terms like "magma" and [[https://en.wikipedia.org/wiki/Quasigroup#Loops][loops]] in
Bourbaki and older literature. A "double loop" is then a set equipped
with two loop structures.

I also suspect that, since the Mizar project initially started working
in Poland in the 1970s, it used the literature available to it. For
example, Wanda Szmielew's {{{book-title(From Affine to Euclidean Geometry: An Axiomatic Approach)}}}
formalizes the notions of loops, double loops, etc. The book is an
impressive piece of mathematical writing, and little known in the West.
#+end_remark

The bare minimum we need to formalize the notion of a field requires:
- a set $F$
- a function $+\colon F\times F\to F$ (~addF~ in Mizar)
- a function $\cdot F\times F\to F$ (~multF~ in Mizar)
- a constant $1_{F}\in F$ (~OneF~ in Mizar)
- another constant $0_{F}\in F$ (~ZeroF~ in Mizar).

There are utility functions like [[https://mizar.uwb.edu.pl/version/current/html/struct_0.html#K4][~0.F~]] to refer to ~the ZeroF of F~,
and [[https://mizar.uwb.edu.pl/version/current/html/struct_0.html#K4][~1.F~]] for ~the OneF of F~.

Mizar then uses adjectives to define:

- a [[https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#NM3][Ring]] is a nonempty double loop satisfying all the properties of a
  field */except/* (1) the commutativity of multiplication and (2)
  almost left invertibility (i.e., every nonzero element of the field
  has a multiplicative inverse)
- a [[https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#NM4][Skew-Field]] is a [[https://mizar.uwb.edu.pl/version/current/html/struct_0.html#V6][~nondegenerated~]] (i.e., $0\neq 1$) almost left
  invertible Ring
- a [[https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#NM5][Field]] is a commutative Skew-Field

If we want to consider the real numbers as a field, we would use
[[https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#K2][~F_Real~]].

If we want to consider the complex numbers as a field, we would use
[[https://mizar.uwb.edu.pl/version/current/html/complfld.html#K1][~F_Complex~]].

