docs/comp-sci/theorem-provers/mizar/linear-algebra.html

<div id="outline-container-h-0fca0004-528d-4dea-9959-1f1f77350df5" class="outline-4">
<h4 id="h-0fca0004-528d-4dea-9959-1f1f77350df5">\(\mathbb{F}^{n}\)</h4>
<div class="outline-text-4" id="text-h-0fca0004-528d-4dea-9959-1f1f77350df5">
<ul class="org-ul">
<li><b>Definition 1.11.</b>
<ul class="org-ul">
<li>\(\mathbb{F}^{n}\) denotes the set of all lists of
length \(n\) of elements of \(\mathbb{F}\)
<ul class="org-ul">
<li>In Mizar, this could be formalized as <code>Funcs(Seg n,COMPLEX)</code> or
<code>Funcs(Seg n,REAL)</code></li>
</ul></li>
<li>If \((x_{1},\dots,x_{n})\in\mathbb{F}^{n}\) and \(k\in\{1,\dots,n\}\),
then \(x_{k}\) is the \(k^{\text{th}}\) coordinate of \(x\).
<ul class="org-ul">
<li>In Mizar, this is denoted <code>x.k</code></li>
</ul></li>
</ul></li>
<li><b>Definition 1.13.</b>
Addition in \(\mathbb{F}^{n}\) is defined componentwise
\((x_{1},\dots,x_{n})+(y_{1},\dots,y_{n})=(x_{1}+y_{1},\dots,x_{n}+y_{n})\).
<ul class="org-ul">
<li>This is formalized in <a href="https://mizar.uwb.edu.pl/version/current/html/fvsum_1.html#K3"><code>FVSUM_1:def 3</code></a>.</li>
</ul></li>
<li><b>Theorem 1.14</b> (Commutativity of addition in \(\mathbb{F}^{n}\)).
If \(x,y\in\mathbb{F}^{n}\), then \(x+y=y+x\).
<ul class="org-ul">
<li>This is automatic with the registrations of <code>FVSUM_1</code></li>
</ul></li>
<li><b>Notation 1.15</b> (0).
It's common to denote by 0 the list of length \(n\) whose entries are
all zero.
<ul class="org-ul">
<li>In Mizar, we can denote this by <code>(n |-&gt; 0)</code> using <a href="https://mizar.uwb.edu.pl/version/current/html/finseq_2.html#K5"><code>FINSEQ_2:def 2</code></a></li>
</ul></li>
<li><b>Definition 1.17</b> (Additive inverse on \(\mathbb{F}^{n}\)).
For \(x\in\mathbb{F}^{n}\), the <dfn>Additive Inverse</dfn> of \(x\),
denoted \(-x\), is the element \(-x\in\mathbb{F}^{n}\) such that
\(x+(-x)=0\).
<ul class="org-ul">
<li>This is definition <a href="https://mizar.uwb.edu.pl/version/current/html/fvsum_1.html#K5"><code>FVSUM_1:def 4</code></a></li>
</ul></li>
<li><b>Definition 1.18</b> (Scalar multiplication on \(\mathbb{F}^{n}\)).
The <dfn>Product</dfn> of a number \(\lambda\in\mathbb{F}\) and a vector \(x=(x_{1},\dots,x_{n})\in\mathbb{F}^{n}\)
is the vector obtained by multiplying componentwise by \(\lambda\):
\(\lambda x=(\lambda x_{1},\dots,\lambda x_{n})\).
<ul class="org-ul">
<li>This is definition <a href="https://mizar.uwb.edu.pl/version/current/html/fvsum_1.html#K9"><code>FVSUM_1:def 6</code></a></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-h-1f8560be-d80c-49e5-94e2-f55d13dcb275" class="outline-4">
<h4 id="h-1f8560be-d80c-49e5-94e2-f55d13dcb275">Digression on Fields</h4>
<div class="outline-text-4" id="text-h-1f8560be-d80c-49e5-94e2-f55d13dcb275">
<p>
Axler gives a brief digression about fields. I will take this
opportunity to discuss Mizar's formalization <code>Field</code> of fields.
</p>

<p>
Introductory linear algebra courses give the uninspiring definition of a
field as something along the lines of:
</p>

<ul class="org-ul">
<li><p>
<b>Implicit Definition.</b> A <dfn>Field</dfn> consists of a set
\(\mathbb{F}\) equipped with
</p>
<ul class="org-ul">
<li>addition \(+\colon\mathbb{F}\times\mathbb{F}\to\mathbb{F}\)</li>
<li>negation \(-\colon\mathbb{F}\to\mathbb{F}\)</li>
<li>a constant \(0\in\mathbb{F}\)</li>
<li>multiplication \(\,\cdot\,\colon\mathbb{F}\times\mathbb{F}\to\mathbb{F}\)</li>
<li>inversion \((-)^{-1}\colon\mathbb{F}\to\mathbb{F}\) (Mizar denoted \(x^{-1}\) as <code>x"</code>)</li>
<li>a constant \(1\in\mathbb{F}\)</li>
</ul>

<p>
such that
</p>

<ul class="org-ul">
<li>addition is commutative \(x+y=y+x\) (<a href="https://mizar.uwb.edu.pl/version/current/html/rlvect_1.html#V2"><code>Abelian</code></a>)</li>
<li>addition is associative \(x+(y+z)=(x+y)+z\) (<a href="https://mizar.uwb.edu.pl/version/current/html/rlvect_1.html#V3"><code>add-associative</code></a>)</li>
<li>zero is unit for addition: \(x+0=x\) (<a href="https://mizar.uwb.edu.pl/version/current/html/rlvect_1.html#V4"><code>right_zeroed</code></a>) and as a
consequence of commutativity \(0+x=x\)</li>
<li>negation gives additive inverse \(x+(-x)=0\) (<a href="https://mizar.uwb.edu.pl/version/current/html/algstr_0.html#V10"><code>right_complementable</code></a>)</li>
<li>multiplication is commutative \(xy=yx\) (<a href="https://mizar.uwb.edu.pl/version/current/html/group_1.html#V5"><code>commutative</code></a>)</li>
<li>multiplication is associative \((xy)z=x(yz)\) (<a href="https://mizar.uwb.edu.pl/version/current/html/group_1.html#V3"><code>associative</code></a>)</li>
<li>one is the unit for multiplication \(1\cdot x=x\cdot 1=x\) (<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#V4"><code>well-unital</code></a>)</li>
<li>inversion is the multiplicative inverse when \(x\neq0\),
\(x^{-1}\cdot x=1\) (<a href="https://mizar.uwb.edu.pl/version/current/html/algstr_0.html#V33"><code>almost_left_invertible</code></a> = all nonzero elements are
<a href="https://mizar.uwb.edu.pl/version/current/html/algstr_0.html#V23"><code>left_invertible</code></a>) and then commutativity gives us \(x\cdot x^{-1}=1\)</li>
<li>multiplication distributes over addition: \(x(y+z)=xy+xz\) (<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#V5"><code>distributive</code></a>)</li>
</ul></li>
</ul>

<p>
Later on, students learn there is a hierarchy of generalizations of
fields (rings and things).
</p>

<p>
Idiomatic Mizar defines a structure, then attaches adjectives to it to
form a mathematical gadget. The underlying structure for fields
coincides with rings (and things), and is formalize as <a href="https://mizar.uwb.edu.pl/version/current/html/algstr_0.html#L6"><code>doubleLoopStr</code></a>
in Mizar.
</p>

<div class="remark" id="org31e2823">
<p>
To American university students, this is an odd choice of
name, but most of abstract algebra has only been standardized fairly
recently &#x2014; it is not uncommon to find terms like "magma" and <a href="https://en.wikipedia.org/wiki/Quasigroup#Loops">loops</a> in
Bourbaki and older literature. A "double loop" is then a set equipped
with two loop structures.
</p>

<p>
I also suspect that, since the Mizar project initially started working
in Poland in the 1970s, it used the literature available to it. For
example, Wanda Szmielew's <cite class="book-title">From Affine to Euclidean Geometry: An Axiomatic Approach</cite>
formalizes the notions of loops, double loops, etc. The book is an
impressive piece of mathematical writing, and little known in the West.
</p>

</div>

<p>
The bare minimum we need to formalize the notion of a field requires:
</p>
<ul class="org-ul">
<li>a set \(F\)</li>
<li>a function \(+\colon F\times F\to F\) (<code>addF</code> in Mizar)</li>
<li>a function \(\cdot F\times F\to F\) (<code>multF</code> in Mizar)</li>
<li>a constant \(1_{F}\in F\) (<code>OneF</code> in Mizar)</li>
<li>another constant \(0_{F}\in F\) (<code>ZeroF</code> in Mizar).</li>
</ul>

<p>
There are utility functions like <a href="https://mizar.uwb.edu.pl/version/current/html/struct_0.html#K4"><code>0.F</code></a> to refer to <code>the ZeroF of F</code>,
and <a href="https://mizar.uwb.edu.pl/version/current/html/struct_0.html#K4"><code>1.F</code></a> for <code>the OneF of F</code>.
</p>

<p>
Mizar then uses adjectives to define:
</p>

<ul class="org-ul">
<li>a <a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#NM3">Ring</a> is a nonempty double loop satisfying all the properties of a
field <b><i>except</i></b> (1) the commutativity of multiplication and (2)
almost left invertibility (i.e., every nonzero element of the field
has a multiplicative inverse)</li>
<li>a <a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#NM4">Skew-Field</a> is a <a href="https://mizar.uwb.edu.pl/version/current/html/struct_0.html#V6"><code>nondegenerated</code></a> (i.e., \(0\neq 1\)) almost left
invertible Ring</li>
<li>a <a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#NM5">Field</a> is a commutative Skew-Field</li>
</ul>

<p>
If we want to consider the real numbers as a field, we would use
<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#K2"><code>F_Real</code></a>.
</p>

<p>
If we want to consider the complex numbers as a field, we would use
<a href="https://mizar.uwb.edu.pl/version/current/html/complfld.html#K1"><code>F_Complex</code></a>.
</p>
</div>
</div>
</div>
