comp-sci/theorem-provers/mizar/linear-algebra.org
** 1B. Definition of Vector Spaces
:PROPERTIES:
:CUSTOM_ID: h-174a9872-70d2-4480-b277-d54d59d38691
:END:

- We have a [[https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#L1][~ModuleStr~]] over some gadget $F$ in Mizar be a structure
  consisting of:
  - an underlying set called the ~carrier~,
  - a binary operator ~addF~ on the ~carrier~ (corresponding to vector addition),
  - a constant ~ZeroF~ belonging to the ~carrier~ (corresponding to the
    zero vector), and
  - a function
    $\mathtt{lmult}\colon F\times\mathtt{carrier}\to\mathtt{carrier}$
    corresponding to scalar multiplication
- *Definition 1.20.*
  When $\mathbb{F}$ is a field, we define a {{{dfn(Vector Space)}}} over
  $\mathbb{F}$ to consist of a set $V$ equipped with
  - a binary operator $\cdot\colon\mathbb{F}\times V\to V$ called
    /scalar multiplication/
  - a binary operator $+\colon V\times V\to V$ called /vector addition
  - a constant $0\in V$ called the /zero vector/

  (i.e., it consists of a ~ModuleStr~ over $\mathbb{F}$)
  such that

  - commutativity of vector addition $u+v=v+u$ for all $u,v\in V$
    ([[https://mizar.uwb.edu.pl/version/current/html/rlvect_1.html#V2][~Abelian~]])
  - associativity of vector addition $(u+v)+w=u+(v+w)$ for all $u,v,w\in V$
    ([[https://mizar.uwb.edu.pl/version/current/html/rlvect_1.html#V3][~add-associative~]])
  - associativity of scalar multiplication $a\cdot(b\cdot v)=(ab)\cdot v$
    for all $a,b\in\mathbb{F}$ and $v\in V$ ([[https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#V10][~scalar-associative~]])
  - additive identity $v+0=v$ ([[https://mizar.uwb.edu.pl/version/current/html/rlvect_1.html#V4][~right_zeroed~]]) and by commutativity $0+v=v$ for all $v\in V$
  - additive inverse: for each $v\in V$, there exists a $w\in V$ such
    that $v+w=0$ (i.e., every element is [[https://mizar.uwb.edu.pl/version/current/html/algstr_0.html#V10][~right_complementable~]])
  - multiplicative identity: $1\cdot v=v$ for all $v\in V$
    ([[https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#V11][~scalar-unital~]])
  - distributivity of scalar multiplication over vector addition:
    $a\cdot(u+v)=(a\cdot u)+(a\cdot v)$ for all $a\in\mathbb{F}$ and
    $u,v\in V$ ([[https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#V8][~vector-distributive~]])
  - distributivity of scalar multiplication over scalar addition:
    $(a+b)\cdot v = (a\cdot v)+(b\cdot v)$
    for all $a,b\in\mathbb{F}$ and $v\in V$
    ([[https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#V9][~scalar-distributive~]])
- This is precisely the definition of a [[https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#NM9][~VectSp of F~]] in Mizar
- *Definition 1.21.*
  Elements of a vector space are called {{{dfn(Vectors)}}}
  - [[https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#NM8][~Vector~]] is defined thus, and ~Scalar of VS~ is shorthand for an
    element of ~F~ the field.
- *Definition 1.22* (Real vector space, complex vector space).
  A vector space over $\mathbb{R}$ is called a {{{dfn(Real Vector Space)}}}, and
  a vector space over $\mathbb{C}$ is called a {{{dfn(Complex Vector Space)}}}.
  - In Mizar, when we specialize attention to real vector spaces, we
    refer to them as [[https://mizar.uwb.edu.pl/version/current/html/rlvect_1.html#NM2][~RealLinearSpace~]]
  - For complex vector spaces, they are [[https://mizar.uwb.edu.pl/version/current/html/clvect_1.html#NM2][~ComplexLinearSpace~]]
- *Notation 1.24.*
  - If $S$ is a set, then $\mathbb{F}^{S}$ is the set of functions from
    $S$ to $\mathbb{F}$
    - Mizar notation: [[https://mizar.uwb.edu.pl/version/current/html/funct_2.html#K1][~Funcs(S,the carrier of F)~]]
  - For $f,g\in\mathbb{F}^{S}$, the sum $f+g\mathbb{F}^{S}$ is defined
    by $(f+g)(x)=f(x)+g(x)$ for all $x\in S$.
    - This is definition [[https://mizar.uwb.edu.pl/version/current/html/valued_1.html#K1][~VALUED_1:def 1~]]
  - If $\lambda\in\mathbb{F}$ and $f\in\mathbb{F}^{S}$, the product
    $\lambda f\in\mathbb{F}^{S}$ is defined by $(\lambda f)(x)=\lambda f(x)$
    for every $x\in S$.
    - This is probably defined somewhere, I think ~(S --> {lambda}) [#] f~
      is a kludge solution
- *Theorem 1.26* (Unique additive identity).
  A vector space has a unique additive identity. {{{missing()}}}
- *Theorem 1.27* (Unique additive inverse).
  Every element in a vector space has a unique additive inverse.
  ([[https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#T16][~VECTSP_1:16~]])
- *Theorem 1.30.* For each $v\in V$, $0\cdot v=0$.
  ([[https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#T14][~VECTSP_1:14~]])
- *Theorem 1.31.* For every $a\in\mathbb{F}$, $a\cdot 0=0$. ([[https://mizar.uwb.edu.pl/version/current/html/vectsp_2.html#T30][~VECTSP_2:30~]])
- *Theorem 1.32.*
  For each $v\in V$, $(-1)\cdot v = -v$.
  ([[https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#T14][~VECTSP_1:14~]])
  
** 1C. Subspaces
:PROPERTIES:
:CUSTOM_ID: h-9e2b8b08-bedb-4193-bc7c-ee8cd4b4573b
:END:

- *Definition 1.33.*
  A subset $U\subset V$ is called a {{{dfn(Subspace)}}} of $V$ if $U$ is
  also a vector space with the same additive identity, addition, and
  scalar multiplication as on $V$.
  - Mizar defines [[https://mizar.uwb.edu.pl/version/current/html/vectsp_4.html#M1][~Subspace of V~]] as restricting the addition and scalar
    multiplication to $U$
- *Theorem 1.34* (Conditions for a Subspace).
  A subset $U$ of $V$ is a subspace of $V$ if and only if $U$ satisfies
  three conditions: (1) it contains the additive identity $0\in U$,
  (2) closed under addition $u,w\in U$ implies $u+w\in U$, and
  (3) closed under scalar multiplication $a\in\mathbb{F}$ and $u\in U$
  implies $a\cdot u\in U$.
  - ([[https://mizar.uwb.edu.pl/version/current/html/vectsp_4.html#T34][~VECTSP_4:34~]])
- *Implicit Examples.* The zero subspace (consisting only of the zero
  vector) is denoted [[https://mizar.uwb.edu.pl/version/current/html/vectsp_4.html#K1][~(0).V~]]; and $V$ considered as a subspace of itself
  is [[https://mizar.uwb.edu.pl/version/current/html/vectsp_4.html#K2][~(Omega).V~]].
- *Implicit Definition.* If $U$ and $W$ are subspaces of $V$, then $U\cap W$
  is a subspace of $V$.
  - [[https://mizar.uwb.edu.pl/version/current/html/vectsp_5.html#K2][~VECTSP_5:def 2~]]
- *Implicit Theorem.* Let $U_{1}$, $U_{2}$ be subspaces of $V$.
  If the underlying set of $U_{1}$ is a subset of the underlying set of
  $U_{2}$, then $U_{1}$ is a subspace of $U_{2}$. ([[https://mizar.uwb.edu.pl/version/current/html/vectsp_4.html#T27][~VECTSP_4:27~]])
- *Implicit Theorem.* Let $U_{1}$, $U_{2}$, $U_{3}$ be subspaces of $V$.
  If $U_{1}$ is a subspace of $U_{2}$ and $U_{2}$ is a subspace of
  $U_{3}$, then $U_{1}$ is a subspace of $U_{3}$.
  ([[https://mizar.uwb.edu.pl/version/current/html/vectsp_4.html#T26][~VECTSP_4:26~]])

