docs/comp-sci/theorem-provers/mizar/linear-algebra.html

<div id="outline-container-h-174a9872-70d2-4480-b277-d54d59d38691" class="outline-3">
<h3 id="h-174a9872-70d2-4480-b277-d54d59d38691">1B. Definition of Vector Spaces</h3>
<div class="outline-text-3" id="text-h-174a9872-70d2-4480-b277-d54d59d38691">
<ul class="org-ul">
<li>We have a <a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#L1"><code>ModuleStr</code></a> over some gadget \(F\) in Mizar be a structure
consisting of:
<ul class="org-ul">
<li>an underlying set called the <code>carrier</code>,</li>
<li>a binary operator <code>addF</code> on the <code>carrier</code> (corresponding to vector addition),</li>
<li>a constant <code>ZeroF</code> belonging to the <code>carrier</code> (corresponding to the
zero vector), and</li>
<li>a function
\(\mathtt{lmult}\colon F\times\mathtt{carrier}\to\mathtt{carrier}\)
corresponding to scalar multiplication</li>
</ul></li>
<li><p>
<b>Definition 1.20.</b>
When \(\mathbb{F}\) is a field, we define a <dfn>Vector Space</dfn> over
\(\mathbb{F}\) to consist of a set \(V\) equipped with
</p>
<ul class="org-ul">
<li>a binary operator \(\cdot\colon\mathbb{F}\times V\to V\) called
<i>scalar multiplication</i></li>
<li>a binary operator \(+\colon V\times V\to V\) called /vector addition</li>
<li>a constant \(0\in V\) called the <i>zero vector</i></li>
</ul>

<p>
(i.e., it consists of a <code>ModuleStr</code> over \(\mathbb{F}\))
such that
</p>

<ul class="org-ul">
<li>commutativity of vector addition \(u+v=v+u\) for all \(u,v\in V\)
(<a href="https://mizar.uwb.edu.pl/version/current/html/rlvect_1.html#V2"><code>Abelian</code></a>)</li>
<li>associativity of vector addition \((u+v)+w=u+(v+w)\) for all \(u,v,w\in V\)
(<a href="https://mizar.uwb.edu.pl/version/current/html/rlvect_1.html#V3"><code>add-associative</code></a>)</li>
<li>associativity of scalar multiplication \(a\cdot(b\cdot v)=(ab)\cdot v\)
for all \(a,b\in\mathbb{F}\) and \(v\in V\) (<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#V10"><code>scalar-associative</code></a>)</li>
<li>additive identity \(v+0=v\) (<a href="https://mizar.uwb.edu.pl/version/current/html/rlvect_1.html#V4"><code>right_zeroed</code></a>) and by commutativity \(0+v=v\) for all \(v\in V\)</li>
<li>additive inverse: for each \(v\in V\), there exists a \(w\in V\) such
that \(v+w=0\) (i.e., every element is <a href="https://mizar.uwb.edu.pl/version/current/html/algstr_0.html#V10"><code>right_complementable</code></a>)</li>
<li>multiplicative identity: \(1\cdot v=v\) for all \(v\in V\)
(<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#V11"><code>scalar-unital</code></a>)</li>
<li>distributivity of scalar multiplication over vector addition:
\(a\cdot(u+v)=(a\cdot u)+(a\cdot v)\) for all \(a\in\mathbb{F}\) and
\(u,v\in V\) (<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#V8"><code>vector-distributive</code></a>)</li>
<li>distributivity of scalar multiplication over scalar addition:
\((a+b)\cdot v = (a\cdot v)+(b\cdot v)\)
for all \(a,b\in\mathbb{F}\) and \(v\in V\)
(<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#V9"><code>scalar-distributive</code></a>)</li>
</ul></li>
<li>This is precisely the definition of a <a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#NM9"><code>VectSp of F</code></a> in Mizar</li>
<li><b>Definition 1.21.</b>
Elements of a vector space are called <dfn>Vectors</dfn>
<ul class="org-ul">
<li><a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#NM8"><code>Vector</code></a> is defined thus, and <code>Scalar of VS</code> is shorthand for an
element of <code>F</code> the field.</li>
</ul></li>
<li><b>Definition 1.22</b> (Real vector space, complex vector space).
A vector space over \(\mathbb{R}\) is called a <dfn>Real Vector Space</dfn>, and
a vector space over \(\mathbb{C}\) is called a <dfn>Complex Vector Space</dfn>.
<ul class="org-ul">
<li>In Mizar, when we specialize attention to real vector spaces, we
refer to them as <a href="https://mizar.uwb.edu.pl/version/current/html/rlvect_1.html#NM2"><code>RealLinearSpace</code></a></li>
<li>For complex vector spaces, they are <a href="https://mizar.uwb.edu.pl/version/current/html/clvect_1.html#NM2"><code>ComplexLinearSpace</code></a></li>
</ul></li>
<li><b>Notation 1.24.</b>
<ul class="org-ul">
<li>If \(S\) is a set, then \(\mathbb{F}^{S}\) is the set of functions from
\(S\) to \(\mathbb{F}\)
<ul class="org-ul">
<li>Mizar notation: <a href="https://mizar.uwb.edu.pl/version/current/html/funct_2.html#K1"><code>Funcs(S,the carrier of F)</code></a></li>
</ul></li>
<li>For \(f,g\in\mathbb{F}^{S}\), the sum \(f+g\mathbb{F}^{S}\) is defined
by \((f+g)(x)=f(x)+g(x)\) for all \(x\in S\).
<ul class="org-ul">
<li>This is definition <a href="https://mizar.uwb.edu.pl/version/current/html/valued_1.html#K1"><code>VALUED_1:def 1</code></a></li>
</ul></li>
<li>If \(\lambda\in\mathbb{F}\) and \(f\in\mathbb{F}^{S}\), the product
\(\lambda f\in\mathbb{F}^{S}\) is defined by \((\lambda f)(x)=\lambda f(x)\)
for every \(x\in S\).
<ul class="org-ul">
<li>This is probably defined somewhere, I think <code>(S --&gt; {lambda}) [#] f</code>
is a kludge solution</li>
</ul></li>
</ul></li>
<li><b>Theorem 1.26</b> (Unique additive identity).
A vector space has a unique additive identity. <span class="missing">Missing from Mizar</span></li>
<li><b>Theorem 1.27</b> (Unique additive inverse).
Every element in a vector space has a unique additive inverse.
(<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#T16"><code>VECTSP_1:16</code></a>)</li>
<li><b>Theorem 1.30.</b> For each \(v\in V\), \(0\cdot v=0\).
(<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#T14"><code>VECTSP_1:14</code></a>)</li>
<li><b>Theorem 1.31.</b> For every \(a\in\mathbb{F}\), \(a\cdot 0=0\). (<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_2.html#T30"><code>VECTSP_2:30</code></a>)</li>
<li><b>Theorem 1.32.</b>
For each \(v\in V\), \((-1)\cdot v = -v\).
(<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#T14"><code>VECTSP_1:14</code></a>)</li>
</ul>
</div>
</div>

<div id="outline-container-h-9e2b8b08-bedb-4193-bc7c-ee8cd4b4573b" class="outline-3">
<h3 id="h-9e2b8b08-bedb-4193-bc7c-ee8cd4b4573b">1C. Subspaces</h3>
<div class="outline-text-3" id="text-h-9e2b8b08-bedb-4193-bc7c-ee8cd4b4573b">
<ul class="org-ul">
<li><b>Definition 1.33.</b>
A subset \(U\subset V\) is called a <dfn>Subspace</dfn> of \(V\) if \(U\) is
also a vector space with the same additive identity, addition, and
scalar multiplication as on \(V\).
<ul class="org-ul">
<li>Mizar defines <a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_4.html#M1"><code>Subspace of V</code></a> as restricting the addition and scalar
multiplication to \(U\)</li>
</ul></li>
<li><b>Theorem 1.34</b> (Conditions for a Subspace).
A subset \(U\) of \(V\) is a subspace of \(V\) if and only if \(U\) satisfies
three conditions: (1) it contains the additive identity \(0\in U\),
(2) closed under addition \(u,w\in U\) implies \(u+w\in U\), and
(3) closed under scalar multiplication \(a\in\mathbb{F}\) and \(u\in U\)
implies \(a\cdot u\in U\).
<ul class="org-ul">
<li>(<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_4.html#T34"><code>VECTSP_4:34</code></a>)</li>
</ul></li>
<li><b>Implicit Examples.</b> The zero subspace (consisting only of the zero
vector) is denoted <a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_4.html#K1"><code>(0).V</code></a>; and \(V\) considered as a subspace of itself
is <a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_4.html#K2"><code>(Omega).V</code></a>.</li>
<li><b>Implicit Definition.</b> If \(U\) and \(W\) are subspaces of \(V\), then \(U\cap W\)
is a subspace of \(V\).
<ul class="org-ul">
<li><a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_5.html#K2"><code>VECTSP_5:def 2</code></a></li>
</ul></li>
<li><b>Implicit Theorem.</b> Let \(U_{1}\), \(U_{2}\) be subspaces of \(V\).
If the underlying set of \(U_{1}\) is a subset of the underlying set of
\(U_{2}\), then \(U_{1}\) is a subspace of \(U_{2}\). (<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_4.html#T27"><code>VECTSP_4:27</code></a>)</li>
<li><b>Implicit Theorem.</b> Let \(U_{1}\), \(U_{2}\), \(U_{3}\) be subspaces of \(V\).
If \(U_{1}\) is a subspace of \(U_{2}\) and \(U_{2}\) is a subspace of
\(U_{3}\), then \(U_{1}\) is a subspace of \(U_{3}\).
(<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_4.html#T26"><code>VECTSP_4:26</code></a>)</li>
</ul>
</div>
