comp-sci/theorem-provers/mizar/linear-algebra.org
*** Sums of Subspaces
:PROPERTIES:
:CUSTOM_ID: h-a7ad4e83-ab15-468b-845c-b3b3c6087b58
:END:

- *Definition 1.36.*
  Suppose $V_{1}$, ..., $V_{m}$ are subspaces of $V$.
  We define the {{{dfn(Sum)}}} of $V_{1}$, ..., $V_{m}$ (denoted by
  $V_{1}+ \dots + V_{m}$) to be the set
  $V_{1}+ \dots + V_{m} = \{v_{1} + \dots + v_{m}\mid v_{1}\in V_{1},\dots,v_{m}\in V_{m}\}$.
  - [[https://mizar.uwb.edu.pl/version/current/html/vectsp_5.html#K1][~VECTSP_5:def 1~]]
- *Implicit Theorem.* We have for any subspaces $V_{1}$ and $V_{2}$ of $V$,
  $V_{1}+V_{2} = V_{2}+V_{1}$. ([[https://mizar.uwb.edu.pl/version/current/html/vectsp_5.html#T5][~VECTSP_5:5~]])
- *Implicit Theorem.* For any subspaces $V_{1}$, $V_{2}$, $V_{3}$ of
  $V$, we have
  $V_{1}+(V_{2}+V_{3})=(V_{1}+V_{2})+V_{3}$.
  ([[https://mizar.uwb.edu.pl/version/current/html/vectsp_5.html#T6][~VECTSP_5:6~]]).
- *Implicit Theorem.* For any subspaces $V_{1}$ and $V_{2}$ of $V$,
  $V_{1}$ is a subspace of $V_{1}+V_{2}$ and $V_{2}$ is a subspace of $V_{1}+V_{2}$.
  ([[https://mizar.uwb.edu.pl/version/current/html/vectsp_5.html#T7][~VECTSP_5:7~]])
  
*** Direct Sums
:PROPERTIES:
:CUSTOM_ID: h-42b38ede-b986-45d1-83ea-802167e48bf4
:END:

- *Definition 1.41.*
  Let $V_{1}$, ..., $V_{m}$ be subspaces of $V$.
  The sum $V_{1} + \dots + V_{m}$ is called a {{{dfn(Direct Sum)}}} if
  each element of the sum can be written in only one way as a sum, and
  in that case we write $V_{1}\oplus\dots\oplus V_{m}$.
  - [[https://mizar.uwb.edu.pl/version/current/html/vectsp_5.html#R1][~VECTSP_5:def 4~]] defines ~M is_the_direct_sum_of V1,V2~ as a predicate
  - Theorems [[https://mizar.uwb.edu.pl/version/current/html/vectsp_5.html#T48][~VECTSP_5:48~]] and [[https://mizar.uwb.edu.pl/version/current/html/vectsp_5.html#T49][~VECTSP_5:49~]] prove the logical
    equivalence of this definition and Mizar's definition.
- *Theorem 1.45* (Conditions for a direct sum).
  Let $V_{1}$, ..., $V_{m}$ be subspaces of $V$. Then
  $V_{1} + \dots + V_{m}$ is a direct sum if and only if the only way to
  write $0$ as a sum $v_{1}+\dots+v_{m}$ (with $v_{1}\in V_{1}$, ...,
  $v_{m}\in V_{m}$) is by taking each $v_{k}=0$.
  - {{{missing()}}} but this can be easily deduced as a consequence from
    other results.
- *Theorem 1.46* (Direct sum of two subspaces).
  Suppose $U$ and $W$ are subspaces of $V$. Then $U+W$ is a direct sum
  if and only if $U\cap W=\{0\}$.
  - This is taken as the definition [[https://mizar.uwb.edu.pl/version/current/html/vectsp_5.html#R1][~VECTSP_5:def 4~]] 
- *Implicit Theorem.* If $V_{1}=V_{2}\oplus V_{3}$, then $V_{1}=V_{3}\oplus V_{2}$.
  ([[https://mizar.uwb.edu.pl/version/current/html/vectsp_5.html#T41][~VECTSP_5:41~]])

#+begin_remark
It's probably fruitful to define a [Mizar] functor for the direct sum of a
family of vector spaces over the same field, using the universal
property of coproduct objects. But I cannot think of an instance where
it would be useful.
#+end_remark

* Chapter 2 Finite-Dimensional Vector Spaces
:PROPERTIES:
:CUSTOM_ID: h-ccdf5a19-684f-44c8-a176-221c9a00d250
:END:

** 2A. Spans and Linear Independence
:PROPERTIES:
:CUSTOM_ID: h-380d3a5f-17a4-4edd-a8e8-ed23ac3189b9
:END:

*** Linear Combinations and Spans
:PROPERTIES:
:CUSTOM_ID: h-98a875af-e955-423b-9188-754fa928c76c
:END:

- *Definition 2.2.*
  Let $v_{1}$, ..., $v_{m}$ be vectors in $V$.
  A {{{dfn(Linear Combination)}}} of $v_{1}$, ..., $v_{m}$ is any vector
  of the form $a_{1}v_{1}+\dots+a_{m}v_{m}$ where $a_{1},\dots,a_{m}\in\mathbb{F}$.
  - Mizar appears to define the coefficients $a_{1}$, ..., $a_{m}$ for a
    particular linear combination as [[https://mizar.uwb.edu.pl/version/current/html/vectsp_6.html#M2][~LinearCombination of A~]] where $A=\{v_{1},\dots,v_{m}\}$.
    See Theorem [[https://mizar.uwb.edu.pl/version/current/html/vectsp_6.html#T18][~VECTSP_6:18~]] for example.
- *Definition 2.4.*
  The set of all linear combinations of a list of vectors $v_{1}$, ...,
  $v_{m}$ of $V$ is called the {{{dfn(Span)}}} of $v_{1}$, ..., $v_{m}$
  and is denoted by $\operatorname{span}(v_{1},\dots,v_{m})=\{a_{1}v_{1}+\dots+a_{m}v_{m}\mid a_{1},\dots,a_{m}\in\mathbb{F}\}$.
  - [[https://mizar.uwb.edu.pl/version/current/html/vectsp_7.html#K1][~VECTSP_7:def 2~]] calls it ~Lin~
- *Definition 2.9.* A vector space is called
  {{{dfn(Finite-Dimensional)}}}
  if some finite list of vectors in it spans the space. 
  - [[https://mizar.uwb.edu.pl/version/current/html/matrlin.html#V1][~MATRLIN:def 1~]] uses an equivalent condition, namely, that there is
    a finite linearly independent subset which spans the space.
- *Definition 2.13.* A vector space is called
  {{{dfn(Infinite-DImensional)}}} if it is not finite-dimensional.
  {{{missing()}}}

*** Linear Independence
:PROPERTIES:
:CUSTOM_ID: h-7b96ecaf-bd7a-4274-a290-a9a01c3eec78
:END:

- *Definition 2.15.* A list of vectors $v_{1}$, ..., $v_{m}$ of $V$ is
  called {{{dfn(Linearly Independent)}}} if the only choice of
  coefficients $a_{1},\dots,a_{m}\in\mathbb{F}$ which satisfies
  $0 = a_{1}v_{1} + \dots + a_{m}v_{m}$ is $a_{1}=\dots=a_{m}=0$.
  - [[https://mizar.uwb.edu.pl/version/current/html/vectsp_7.html#V1][~VECTSP_7:def 1~]] formalizes ~linearly-independent~ for a set of vectors.
  - $\emptyset$ is registered as linearly independent in [[https://mizar.uwb.edu.pl/version/current/html/vectsp_7.html#FC1][~VECTSP_7~]]
- *Definition 2.17.* A list of vectors is called {{{dfn(Linearly Dependent)}}}
  if it is not linearly independent.
- *Theorem 2.19* (Linear dependence lemma).
  Let $v_{1}$, ..., $v_{m}$ be linearly dependent in $V$. Then there
  exists a $k\in\{1,\dots,m\}$ such that $v_{k}\in\operatorname{span}(v_{1},\dots,v_{k-1})$.
  Further, if $k$ satisfies the condition above, then
  $\operatorname{span}(v_{1},\dots,v_{k-1},v_{k+1},\dots,v_{m})=\operatorname{span}(v_{1},\dots,v_{m})$.
  - {{{missing()}}} but I suspect it can be deduced from [[https://mizar.uwb.edu.pl/version/current/html/vectsp_9.html#T14][~VECTSP_9:14~]]
- *Theorem 2.22.* In finite-dimensional vcetor spaces, the length of
  every linearly independent list of vectors is less than or equal to
  the length of every spanning set of vectors.
  - This seems to be deducible from [[https://mizar.uwb.edu.pl/version/current/html/vectsp_7.html#T19][~VECTSP_7:19~]] but is {{{missing()}}}
- *Theorem 2.25* (finite-dimensional subspaces).
  Every subspace of a finite-dimensional vector space is finite-dimension.
  ([[https://mizar.uwb.edu.pl/version/current/html/vectsp_9.html#T24][~VECTSP_9:24~]])

