docs/comp-sci/theorem-provers/mizar/linear-algebra.html

<div id="outline-container-h-a7ad4e83-ab15-468b-845c-b3b3c6087b58" class="outline-4">
<h4 id="h-a7ad4e83-ab15-468b-845c-b3b3c6087b58">Sums of Subspaces</h4>
<div class="outline-text-4" id="text-h-a7ad4e83-ab15-468b-845c-b3b3c6087b58">
<ul class="org-ul">
<li><b>Definition 1.36.</b>
Suppose \(V_{1}\), &#x2026;, \(V_{m}\) are subspaces of \(V\).
We define the <dfn>Sum</dfn> of \(V_{1}\), &#x2026;, \(V_{m}\) (denoted by
\(V_{1}+ \dots + V_{m}\)) to be the set
\(V_{1}+ \dots + V_{m} = \{v_{1} + \dots + v_{m}\mid v_{1}\in V_{1},\dots,v_{m}\in V_{m}\}\).
<ul class="org-ul">
<li><a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_5.html#K1"><code>VECTSP_5:def 1</code></a></li>
</ul></li>
<li><b>Implicit Theorem.</b> We have for any subspaces \(V_{1}\) and \(V_{2}\) of \(V\),
\(V_{1}+V_{2} = V_{2}+V_{1}\). (<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_5.html#T5"><code>VECTSP_5:5</code></a>)</li>
<li><b>Implicit Theorem.</b> For any subspaces \(V_{1}\), \(V_{2}\), \(V_{3}\) of
\(V\), we have
\(V_{1}+(V_{2}+V_{3})=(V_{1}+V_{2})+V_{3}\).
(<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_5.html#T6"><code>VECTSP_5:6</code></a>).</li>
<li><b>Implicit Theorem.</b> For any subspaces \(V_{1}\) and \(V_{2}\) of \(V\),
\(V_{1}\) is a subspace of \(V_{1}+V_{2}\) and \(V_{2}\) is a subspace of \(V_{1}+V_{2}\).
(<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_5.html#T7"><code>VECTSP_5:7</code></a>)</li>
</ul>
</div>
</div>

<div id="outline-container-h-42b38ede-b986-45d1-83ea-802167e48bf4" class="outline-4">
<h4 id="h-42b38ede-b986-45d1-83ea-802167e48bf4">Direct Sums</h4>
<div class="outline-text-4" id="text-h-42b38ede-b986-45d1-83ea-802167e48bf4">
<ul class="org-ul">
<li><b>Definition 1.41.</b>
Let \(V_{1}\), &#x2026;, \(V_{m}\) be subspaces of \(V\).
The sum \(V_{1} + \dots + V_{m}\) is called a <dfn>Direct Sum</dfn> if
each element of the sum can be written in only one way as a sum, and
in that case we write \(V_{1}\oplus\dots\oplus V_{m}\).
<ul class="org-ul">
<li><a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_5.html#R1"><code>VECTSP_5:def 4</code></a> defines <code>M is_the_direct_sum_of V1,V2</code> as a predicate</li>
<li>Theorems <a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_5.html#T48"><code>VECTSP_5:48</code></a> and <a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_5.html#T49"><code>VECTSP_5:49</code></a> prove the logical
equivalence of this definition and Mizar's definition.</li>
</ul></li>
<li><b>Theorem 1.45</b> (Conditions for a direct sum).
Let \(V_{1}\), &#x2026;, \(V_{m}\) be subspaces of \(V\). Then
\(V_{1} + \dots + V_{m}\) is a direct sum if and only if the only way to
write \(0\) as a sum \(v_{1}+\dots+v_{m}\) (with \(v_{1}\in V_{1}\), &#x2026;,
\(v_{m}\in V_{m}\)) is by taking each \(v_{k}=0\).
<ul class="org-ul">
<li><span class="missing">Missing from Mizar</span> but this can be easily deduced as a consequence from
other results.</li>
</ul></li>
<li><b>Theorem 1.46</b> (Direct sum of two subspaces).
Suppose \(U\) and \(W\) are subspaces of \(V\). Then \(U+W\) is a direct sum
if and only if \(U\cap W=\{0\}\).
<ul class="org-ul">
<li>This is taken as the definition <a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_5.html#R1"><code>VECTSP_5:def 4</code></a></li>
</ul></li>
<li><b>Implicit Theorem.</b> If \(V_{1}=V_{2}\oplus V_{3}\), then \(V_{1}=V_{3}\oplus V_{2}\).
(<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_5.html#T41"><code>VECTSP_5:41</code></a>)</li>
</ul>

<div class="remark" id="org3880afb">
<p>
It's probably fruitful to define a [Mizar] functor for the direct sum of a
family of vector spaces over the same field, using the universal
property of coproduct objects. But I cannot think of an instance where
it would be useful.
</p>

</div>
</div>
</div>
</div>
</div>

<div id="outline-container-h-ccdf5a19-684f-44c8-a176-221c9a00d250" class="outline-2">
<h2 id="h-ccdf5a19-684f-44c8-a176-221c9a00d250">Chapter 2 Finite-Dimensional Vector Spaces</h2>
<div class="outline-text-2" id="text-h-ccdf5a19-684f-44c8-a176-221c9a00d250">
</div>

<div id="outline-container-h-380d3a5f-17a4-4edd-a8e8-ed23ac3189b9" class="outline-3">
<h3 id="h-380d3a5f-17a4-4edd-a8e8-ed23ac3189b9">2A. Spans and Linear Independence</h3>
<div class="outline-text-3" id="text-h-380d3a5f-17a4-4edd-a8e8-ed23ac3189b9">
</div>

<div id="outline-container-h-98a875af-e955-423b-9188-754fa928c76c" class="outline-4">
<h4 id="h-98a875af-e955-423b-9188-754fa928c76c">Linear Combinations and Spans</h4>
<div class="outline-text-4" id="text-h-98a875af-e955-423b-9188-754fa928c76c">
<ul class="org-ul">
<li><b>Definition 2.2.</b>
Let \(v_{1}\), &#x2026;, \(v_{m}\) be vectors in \(V\).
A <dfn>Linear Combination</dfn> of \(v_{1}\), &#x2026;, \(v_{m}\) is any vector
of the form \(a_{1}v_{1}+\dots+a_{m}v_{m}\) where \(a_{1},\dots,a_{m}\in\mathbb{F}\).
<ul class="org-ul">
<li>Mizar appears to define the coefficients \(a_{1}\), &#x2026;, \(a_{m}\) for a
particular linear combination as <a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_6.html#M2"><code>LinearCombination of A</code></a> where \(A=\{v_{1},\dots,v_{m}\}\).
See Theorem <a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_6.html#T18"><code>VECTSP_6:18</code></a> for example.</li>
</ul></li>
<li><b>Definition 2.4.</b>
The set of all linear combinations of a list of vectors \(v_{1}\), &#x2026;,
\(v_{m}\) of \(V\) is called the <dfn>Span</dfn> of \(v_{1}\), &#x2026;, \(v_{m}\)
and is denoted by \(\operatorname{span}(v_{1},\dots,v_{m})=\{a_{1}v_{1}+\dots+a_{m}v_{m}\mid a_{1},\dots,a_{m}\in\mathbb{F}\}\).
<ul class="org-ul">
<li><a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_7.html#K1"><code>VECTSP_7:def 2</code></a> calls it <code>Lin</code></li>
</ul></li>
<li><b>Definition 2.9.</b> A vector space is called
<dfn>Finite-Dimensional</dfn>
if some finite list of vectors in it spans the space. 
<ul class="org-ul">
<li><a href="https://mizar.uwb.edu.pl/version/current/html/matrlin.html#V1"><code>MATRLIN:def 1</code></a> uses an equivalent condition, namely, that there is
a finite linearly independent subset which spans the space.</li>
</ul></li>
<li><b>Definition 2.13.</b> A vector space is called
<dfn>Infinite-DImensional</dfn> if it is not finite-dimensional.
<span class="missing">Missing from Mizar</span></li>
</ul>
</div>
</div>

<div id="outline-container-h-7b96ecaf-bd7a-4274-a290-a9a01c3eec78" class="outline-4">
<h4 id="h-7b96ecaf-bd7a-4274-a290-a9a01c3eec78">Linear Independence</h4>
<div class="outline-text-4" id="text-h-7b96ecaf-bd7a-4274-a290-a9a01c3eec78">
<ul class="org-ul">
<li><b>Definition 2.15.</b> A list of vectors \(v_{1}\), &#x2026;, \(v_{m}\) of \(V\) is
called <dfn>Linearly Independent</dfn> if the only choice of
coefficients \(a_{1},\dots,a_{m}\in\mathbb{F}\) which satisfies
\(0 = a_{1}v_{1} + \dots + a_{m}v_{m}\) is \(a_{1}=\dots=a_{m}=0\).
<ul class="org-ul">
<li><a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_7.html#V1"><code>VECTSP_7:def 1</code></a> formalizes <code>linearly-independent</code> for a set of vectors.</li>
<li>\(\emptyset\) is registered as linearly independent in <a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_7.html#FC1"><code>VECTSP_7</code></a></li>
</ul></li>
<li><b>Definition 2.17.</b> A list of vectors is called <dfn>Linearly Dependent</dfn>
if it is not linearly independent.</li>
<li><b>Theorem 2.19</b> (Linear dependence lemma).
Let \(v_{1}\), &#x2026;, \(v_{m}\) be linearly dependent in \(V\). Then there
exists a \(k\in\{1,\dots,m\}\) such that \(v_{k}\in\operatorname{span}(v_{1},\dots,v_{k-1})\).
Further, if \(k\) satisfies the condition above, then
\(\operatorname{span}(v_{1},\dots,v_{k-1},v_{k+1},\dots,v_{m})=\operatorname{span}(v_{1},\dots,v_{m})\).
<ul class="org-ul">
<li><span class="missing">Missing from Mizar</span> but I suspect it can be deduced from <a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_9.html#T14"><code>VECTSP_9:14</code></a></li>
</ul></li>
<li><b>Theorem 2.22.</b> In finite-dimensional vcetor spaces, the length of
every linearly independent list of vectors is less than or equal to
the length of every spanning set of vectors.
<ul class="org-ul">
<li>This seems to be deducible from <a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_7.html#T19"><code>VECTSP_7:19</code></a> but is <span class="missing">Missing from Mizar</span></li>
</ul></li>
<li><b>Theorem 2.25</b> (finite-dimensional subspaces).
Every subspace of a finite-dimensional vector space is finite-dimension.
(<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_9.html#T24"><code>VECTSP_9:24</code></a>)</li>
</ul>
</div>
</div>
</div>
