comp-sci/theorem-provers/mizar/linear-algebra.org
** 2B. Bases
:PROPERTIES:
:CUSTOM_ID: h-09ad76d0-5a6a-45e9-8243-730112d9daaf
:END:

- *Definition 2.26.* A {{{dfn(Basis)}}} of $V$ is a set of vectors of
  $V$ that is linearly independent and spans $V$.
  - ~VECTSP_7~ defines [[https://mizar.uwb.edu.pl/version/current/html/vectsp_7.html#NM1][~Basis of V~]] is defined as a [[https://mizar.uwb.edu.pl/version/current/html/vectsp_7.html#V2][~base~]] ~Subset of V~, which means it is
    linearly-independent and it spans ~V~.
- *Implicit Definition.* When we have an ordered list of vectors which
  spans $V$, then we call that an {{{dfn(Ordered Basis)}}}. Usually this
  is what people implicitly work with.
  - [[https://mizar.uwb.edu.pl/version/current/html/matrlin.html#M1][~MATRLIN:def 2~]] formalizes ~OrdBasis of V~
- *Theorem 2.30.* Every spanning list contains a basis as a subset. ([[https://mizar.uwb.edu.pl/version/current/html/vectsp_7.html#T20][~VECTSP_7:20~]])
- *Theorem 2.31.* Every finite-dimensional vector space has a
  basis. (This is literally part of the definition of
  ~finite-dimensional~, so it's redundant in Mizar.)
- *Theorem 2.32.* Every linearly independent list of vectors in a
  finite-dimensional vector space can be extended to a basis of the
  vector space. ([[https://mizar.uwb.edu.pl/version/current/html/vectsp_7.html#T19][~VECTSP_7:19~]])
- *Theorem 2.33.* Suppose $V$ is a finite-dimensional space and $U$ is a
  subspace of $V$. Then there exists a subspace $W$ of $V$ such that
  $V=U\oplus W$.
  - The subspace $W$ is called the complement of $U$, and is defined in
    [[https://mizar.uwb.edu.pl/version/current/html/vectsp_5.html#M1][~VECTSP_5:def 5~]]
  
** 2C. Dimension
:PROPERTIES:
:CUSTOM_ID: h-f654065c-e6f6-4b11-bbb7-8a974f704a48
:END:

- *Theorem 2.34.* Any two bases of a finite-dimensional vector space
  have the same length.
- *Definition 2.35.* The {{{dfn(Dimension)}}} of a finite-dimensional
  vector space is the length of any basis of the vector space and is
  denoted $\dim(V)$.
  - [[https://mizar.uwb.edu.pl/version/current/html/vectsp_9.html#K1][~VECTSP_9:def 1~]] formalizes this
- *Theorem 2.37.* If $V$ is a finite-dimensional vector space and $U$ is
  a subspace of $V$, then $\dim(U)\leq\dim(V)$.
  ([[https://mizar.uwb.edu.pl/version/current/html/vectsp_9.html#T25][~VECTSP_9:25~]])
- *Theorem 2.38.* Suppose $V$ is finite-dimensional. Then every linearly
  independent list of vectors in $V$ has length $\dim(V)$ and is a basis
  of $V$. ([[https://mizar.uwb.edu.pl/version/current/html/vectsp_9.html#T26][~VECTSP_9:26~]] is more general)
- *Theorem 2.39.* Let $V$ be finite-dimensional, $U$ be a subspace of $V$.
  If $\dim(U)=\dim(V)$, then $U=V$. ([[https://mizar.uwb.edu.pl/version/current/html/vectsp_9.html#T28][~VECTSP_9:28~]])
- *Theorem 2.43.* If $V_{1}$ and $V_{2}$ are subspaces of a
  finite-dimensional vector space, then
  $\dim(V_{1}+V_{2})=\dim(V_{1})+\dim(V_{2}) - \dim(V_{1}\cap V_{2})$.
  ([[https://mizar.uwb.edu.pl/version/current/html/vectsp_9.html#T32][~VECTSP_9:32~]])

* Chapter 3 Linear Maps
:PROPERTIES:
:CUSTOM_ID: h-4706f12d-af00-418a-92be-d31c72853766
:END:

** 3A. Vector Spaces of Linear Maps
:PROPERTIES:
:CUSTOM_ID: h-f9c5c9ea-d756-4ba9-9bf1-49a069cc10b3
:END:

*** Definitions and Examples
:PROPERTIES:
:CUSTOM_ID: h-ab71d5ec-d816-4323-b2e7-f056ba5819f0
:END:

- *Definition 3.1.* Let $V$, $W$ be vector spaces over the same field $\mathbb{F}$.
  A {{{dfn(Linear Map)}}} from $V$ to $W$ is a function $T\colon V\to W$
  such that it is:
  - *Additive:* $T(u+v)=T(u)+T(v)$ for all $u,v\in V$ ([[https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#V13][~additive~]])
  - *Homogeneous:* $T(\lambda v)=\lambda T(v)$ for all
    $\lambda\in\mathbb{F}$ and $v\in V$ ([[https://mizar.uwb.edu.pl/version/current/html/mod_2.html#V1][~homogeneous~]])
  - [[https://mizar.uwb.edu.pl/version/current/html/ranknull.html#NM1][~RANKNULL~]] defines [[https://mizar.uwb.edu.pl/version/current/html/ranknull.html#NM1][~linear-transformation of V,W~]] as an
    ~additive homogeneous Function of V,W~.
- 
*** Algebraic Operations on $L(V,W)$
:PROPERTIES:
:CUSTOM_ID: h-cf0adbb9-9cfe-4a8e-b479-9ee1b0d11be8
:END:

** 3B. Null Spaces and Ranges
:PROPERTIES:
:CUSTOM_ID: h-98c27132-8546-446a-8ef7-c60c20bcff28
:END:

*** Null Spaces and Injectivity
:PROPERTIES:
:CUSTOM_ID: h-6f6d554e-c664-4957-97e9-dc5721a97f99
:END:

*** Range and Surjectivity
:PROPERTIES:
:CUSTOM_ID: h-98038eca-1e3c-4503-b834-3389a0e825cd
:END:

*** Fundamental Theorem of Linear Maps
:PROPERTIES:
:CUSTOM_ID: h-aca4326c-86bc-4991-a2e9-b6076552fdac
:END:

** 3C. Matrices
:PROPERTIES:
:CUSTOM_ID: h-e4124565-75bd-43c0-a5eb-4a5061eefc9f
:END:

*** Representing a Linear Map by a Matrix
:PROPERTIES:
:CUSTOM_ID: h-30355ddf-3e25-4b66-a06b-1dc9b3574a81
:END:

*** Addition and Scalar Multiplication of Matrices
:PROPERTIES:
:CUSTOM_ID: h-9930e894-2db2-4d0f-9944-d295cf2de9a5
:END:

*** Matrix Multiplication
:PROPERTIES:
:CUSTOM_ID: h-7ed6b163-ce5a-4001-922e-3f54b7794a1d
:END:

*** Column-Row Factorization and Rank of a Matrix
:PROPERTIES:
:CUSTOM_ID: h-25209265-06a6-4144-83a6-27757040afc7
:END:

** 3D. Invertibility and Isomorphisms
:PROPERTIES:
:CUSTOM_ID: h-b56e3b65-7e3f-4d74-bfd0-60a135d74ca5
:END:

*** Invertible Linear Maps
:PROPERTIES:
:CUSTOM_ID: h-5714227b-82f5-4587-abdd-c19383a6b9e8
:END:

*** Isomorphic Vector Spaces
:PROPERTIES:
:CUSTOM_ID: h-614c4b38-c073-466d-8bfc-f01b329b73a9
:END:

*** Linear Maps Thought of as Matrix Multiplication
:PROPERTIES:
:CUSTOM_ID: h-153320cc-2523-41e4-88fa-bd64733c79aa
:END:

*** Change of Basis
:PROPERTIES:
:CUSTOM_ID: h-cf3fc6fa-df96-4bc7-a0c5-8830f3f6935c
:END:

** 3E. Products and Quotients of Vector Spaces
:PROPERTIES:
:CUSTOM_ID: h-0c43a4c8-9e42-42b7-9257-378d124af333
:END:

*** Products of Vector Spaces
:PROPERTIES:
:CUSTOM_ID: h-0d01fa68-3fe3-4e99-be22-6cf833a1dcc4
:END:

