docs/comp-sci/theorem-provers/mizar/linear-algebra.html

<div id="outline-container-h-09ad76d0-5a6a-45e9-8243-730112d9daaf" class="outline-3">
<h3 id="h-09ad76d0-5a6a-45e9-8243-730112d9daaf">2B. Bases</h3>
<div class="outline-text-3" id="text-h-09ad76d0-5a6a-45e9-8243-730112d9daaf">
<ul class="org-ul">
<li><b>Definition 2.26.</b> A <dfn>Basis</dfn> of \(V\) is a set of vectors of
\(V\) that is linearly independent and spans \(V\).
<ul class="org-ul">
<li><code>VECTSP_7</code> defines <a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_7.html#NM1"><code>Basis of V</code></a> is defined as a <a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_7.html#V2"><code>base</code></a> <code>Subset of V</code>, which means it is
linearly-independent and it spans <code>V</code>.</li>
</ul></li>
<li><b>Implicit Definition.</b> When we have an ordered list of vectors which
spans \(V\), then we call that an <dfn>Ordered Basis</dfn>. Usually this
is what people implicitly work with.
<ul class="org-ul">
<li><a href="https://mizar.uwb.edu.pl/version/current/html/matrlin.html#M1"><code>MATRLIN:def 2</code></a> formalizes <code>OrdBasis of V</code></li>
</ul></li>
<li><b>Theorem 2.30.</b> Every spanning list contains a basis as a subset. (<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_7.html#T20"><code>VECTSP_7:20</code></a>)</li>
<li><b>Theorem 2.31.</b> Every finite-dimensional vector space has a
basis. (This is literally part of the definition of
<code>finite-dimensional</code>, so it's redundant in Mizar.)</li>
<li><b>Theorem 2.32.</b> Every linearly independent list of vectors in a
finite-dimensional vector space can be extended to a basis of the
vector space. (<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_7.html#T19"><code>VECTSP_7:19</code></a>)</li>
<li><b>Theorem 2.33.</b> Suppose \(V\) is a finite-dimensional space and \(U\) is a
subspace of \(V\). Then there exists a subspace \(W\) of \(V\) such that
\(V=U\oplus W\).
<ul class="org-ul">
<li>The subspace \(W\) is called the complement of \(U\), and is defined in
<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_5.html#M1"><code>VECTSP_5:def 5</code></a></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-h-f654065c-e6f6-4b11-bbb7-8a974f704a48" class="outline-3">
<h3 id="h-f654065c-e6f6-4b11-bbb7-8a974f704a48">2C. Dimension</h3>
<div class="outline-text-3" id="text-h-f654065c-e6f6-4b11-bbb7-8a974f704a48">
<ul class="org-ul">
<li><b>Theorem 2.34.</b> Any two bases of a finite-dimensional vector space
have the same length.</li>
<li><b>Definition 2.35.</b> The <dfn>Dimension</dfn> of a finite-dimensional
vector space is the length of any basis of the vector space and is
denoted \(\dim(V)\).
<ul class="org-ul">
<li><a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_9.html#K1"><code>VECTSP_9:def 1</code></a> formalizes this</li>
</ul></li>
<li><b>Theorem 2.37.</b> If \(V\) is a finite-dimensional vector space and \(U\) is
a subspace of \(V\), then \(\dim(U)\leq\dim(V)\).
(<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_9.html#T25"><code>VECTSP_9:25</code></a>)</li>
<li><b>Theorem 2.38.</b> Suppose \(V\) is finite-dimensional. Then every linearly
independent list of vectors in \(V\) has length \(\dim(V)\) and is a basis
of \(V\). (<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_9.html#T26"><code>VECTSP_9:26</code></a> is more general)</li>
<li><b>Theorem 2.39.</b> Let \(V\) be finite-dimensional, \(U\) be a subspace of \(V\).
If \(\dim(U)=\dim(V)\), then \(U=V\). (<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_9.html#T28"><code>VECTSP_9:28</code></a>)</li>
<li><b>Theorem 2.43.</b> If \(V_{1}\) and \(V_{2}\) are subspaces of a
finite-dimensional vector space, then
\(\dim(V_{1}+V_{2})=\dim(V_{1})+\dim(V_{2}) - \dim(V_{1}\cap V_{2})\).
(<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_9.html#T32"><code>VECTSP_9:32</code></a>)</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-h-4706f12d-af00-418a-92be-d31c72853766" class="outline-2">
<h2 id="h-4706f12d-af00-418a-92be-d31c72853766">Chapter 3 Linear Maps</h2>
<div class="outline-text-2" id="text-h-4706f12d-af00-418a-92be-d31c72853766">
</div>

<div id="outline-container-h-f9c5c9ea-d756-4ba9-9bf1-49a069cc10b3" class="outline-3">
<h3 id="h-f9c5c9ea-d756-4ba9-9bf1-49a069cc10b3">3A. Vector Spaces of Linear Maps</h3>
<div class="outline-text-3" id="text-h-f9c5c9ea-d756-4ba9-9bf1-49a069cc10b3">
</div>

<div id="outline-container-h-ab71d5ec-d816-4323-b2e7-f056ba5819f0" class="outline-4">
<h4 id="h-ab71d5ec-d816-4323-b2e7-f056ba5819f0">Definitions and Examples</h4>
<div class="outline-text-4" id="text-h-ab71d5ec-d816-4323-b2e7-f056ba5819f0">
<ul class="org-ul">
<li><b>Definition 3.1.</b> Let \(V\), \(W\) be vector spaces over the same field \(\mathbb{F}\).
A <dfn>Linear Map</dfn> from \(V\) to \(W\) is a function \(T\colon V\to W\)
such that it is:
<ul class="org-ul">
<li><b>Additive:</b> \(T(u+v)=T(u)+T(v)\) for all \(u,v\in V\) (<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#V13"><code>additive</code></a>)</li>
<li><b>Homogeneous:</b> \(T(\lambda v)=\lambda T(v)\) for all
\(\lambda\in\mathbb{F}\) and \(v\in V\) (<a href="https://mizar.uwb.edu.pl/version/current/html/mod_2.html#V1"><code>homogeneous</code></a>)</li>
<li><a href="https://mizar.uwb.edu.pl/version/current/html/ranknull.html#NM1"><code>RANKNULL</code></a> defines <a href="https://mizar.uwb.edu.pl/version/current/html/ranknull.html#NM1"><code>linear-transformation of V,W</code></a> as an
<code>additive homogeneous Function of V,W</code>.</li>
</ul></li>
<li></li>
</ul>
</div>
</div>
<div id="outline-container-h-cf0adbb9-9cfe-4a8e-b479-9ee1b0d11be8" class="outline-4">
<h4 id="h-cf0adbb9-9cfe-4a8e-b479-9ee1b0d11be8">Algebraic Operations on \(L(V,W)\)</h4>
<div class="outline-text-4" id="text-h-cf0adbb9-9cfe-4a8e-b479-9ee1b0d11be8">
</div>
</div>
</div>

<div id="outline-container-h-98c27132-8546-446a-8ef7-c60c20bcff28" class="outline-3">
<h3 id="h-98c27132-8546-446a-8ef7-c60c20bcff28">3B. Null Spaces and Ranges</h3>
<div class="outline-text-3" id="text-h-98c27132-8546-446a-8ef7-c60c20bcff28">
</div>

<div id="outline-container-h-6f6d554e-c664-4957-97e9-dc5721a97f99" class="outline-4">
<h4 id="h-6f6d554e-c664-4957-97e9-dc5721a97f99">Null Spaces and Injectivity</h4>
<div class="outline-text-4" id="text-h-6f6d554e-c664-4957-97e9-dc5721a97f99">
</div>
</div>

<div id="outline-container-h-98038eca-1e3c-4503-b834-3389a0e825cd" class="outline-4">
<h4 id="h-98038eca-1e3c-4503-b834-3389a0e825cd">Range and Surjectivity</h4>
<div class="outline-text-4" id="text-h-98038eca-1e3c-4503-b834-3389a0e825cd">
</div>
</div>

<div id="outline-container-h-aca4326c-86bc-4991-a2e9-b6076552fdac" class="outline-4">
<h4 id="h-aca4326c-86bc-4991-a2e9-b6076552fdac">Fundamental Theorem of Linear Maps</h4>
<div class="outline-text-4" id="text-h-aca4326c-86bc-4991-a2e9-b6076552fdac">
</div>
</div>
</div>

<div id="outline-container-h-e4124565-75bd-43c0-a5eb-4a5061eefc9f" class="outline-3">
<h3 id="h-e4124565-75bd-43c0-a5eb-4a5061eefc9f">3C. Matrices</h3>
<div class="outline-text-3" id="text-h-e4124565-75bd-43c0-a5eb-4a5061eefc9f">
</div>

<div id="outline-container-h-30355ddf-3e25-4b66-a06b-1dc9b3574a81" class="outline-4">
<h4 id="h-30355ddf-3e25-4b66-a06b-1dc9b3574a81">Representing a Linear Map by a Matrix</h4>
<div class="outline-text-4" id="text-h-30355ddf-3e25-4b66-a06b-1dc9b3574a81">
</div>
</div>

<div id="outline-container-h-9930e894-2db2-4d0f-9944-d295cf2de9a5" class="outline-4">
<h4 id="h-9930e894-2db2-4d0f-9944-d295cf2de9a5">Addition and Scalar Multiplication of Matrices</h4>
<div class="outline-text-4" id="text-h-9930e894-2db2-4d0f-9944-d295cf2de9a5">
</div>
</div>

<div id="outline-container-h-7ed6b163-ce5a-4001-922e-3f54b7794a1d" class="outline-4">
<h4 id="h-7ed6b163-ce5a-4001-922e-3f54b7794a1d">Matrix Multiplication</h4>
<div class="outline-text-4" id="text-h-7ed6b163-ce5a-4001-922e-3f54b7794a1d">
</div>
</div>

<div id="outline-container-h-25209265-06a6-4144-83a6-27757040afc7" class="outline-4">
<h4 id="h-25209265-06a6-4144-83a6-27757040afc7">Column-Row Factorization and Rank of a Matrix</h4>
<div class="outline-text-4" id="text-h-25209265-06a6-4144-83a6-27757040afc7">
</div>
</div>
</div>

<div id="outline-container-h-b56e3b65-7e3f-4d74-bfd0-60a135d74ca5" class="outline-3">
<h3 id="h-b56e3b65-7e3f-4d74-bfd0-60a135d74ca5">3D. Invertibility and Isomorphisms</h3>
<div class="outline-text-3" id="text-h-b56e3b65-7e3f-4d74-bfd0-60a135d74ca5">
</div>

<div id="outline-container-h-5714227b-82f5-4587-abdd-c19383a6b9e8" class="outline-4">
<h4 id="h-5714227b-82f5-4587-abdd-c19383a6b9e8">Invertible Linear Maps</h4>
<div class="outline-text-4" id="text-h-5714227b-82f5-4587-abdd-c19383a6b9e8">
</div>
</div>

<div id="outline-container-h-614c4b38-c073-466d-8bfc-f01b329b73a9" class="outline-4">
<h4 id="h-614c4b38-c073-466d-8bfc-f01b329b73a9">Isomorphic Vector Spaces</h4>
<div class="outline-text-4" id="text-h-614c4b38-c073-466d-8bfc-f01b329b73a9">
</div>
</div>

<div id="outline-container-h-153320cc-2523-41e4-88fa-bd64733c79aa" class="outline-4">
<h4 id="h-153320cc-2523-41e4-88fa-bd64733c79aa">Linear Maps Thought of as Matrix Multiplication</h4>
<div class="outline-text-4" id="text-h-153320cc-2523-41e4-88fa-bd64733c79aa">
</div>
</div>

<div id="outline-container-h-cf3fc6fa-df96-4bc7-a0c5-8830f3f6935c" class="outline-4">
<h4 id="h-cf3fc6fa-df96-4bc7-a0c5-8830f3f6935c">Change of Basis</h4>
<div class="outline-text-4" id="text-h-cf3fc6fa-df96-4bc7-a0c5-8830f3f6935c">
</div>
</div>
</div>

<div id="outline-container-h-0c43a4c8-9e42-42b7-9257-378d124af333" class="outline-3">
<h3 id="h-0c43a4c8-9e42-42b7-9257-378d124af333">3E. Products and Quotients of Vector Spaces</h3>
<div class="outline-text-3" id="text-h-0c43a4c8-9e42-42b7-9257-378d124af333">
</div>

<div id="outline-container-h-0d01fa68-3fe3-4e99-be22-6cf833a1dcc4" class="outline-4">
<h4 id="h-0d01fa68-3fe3-4e99-be22-6cf833a1dcc4">Products of Vector Spaces</h4>
<div class="outline-text-4" id="text-h-0d01fa68-3fe3-4e99-be22-6cf833a1dcc4">
</div>
</div>
