comp-sci/theorem-provers/mizar/linear-algebra.org
*** Quotient Spaces
:PROPERTIES:
:CUSTOM_ID: h-b13d8b50-b13d-4d3c-af74-4b0308be8c17
:END:

** 3F. Duality
:PROPERTIES:
:CUSTOM_ID: h-5700ba79-2cba-4eb2-82d2-33d2ca1ec17d
:END:

*** Dual Space and Dual Map
:PROPERTIES:
:CUSTOM_ID: h-efb99066-3590-4e66-8ccc-7dcd67ef5ed0
:END:

*** Null Space and Range of Dual of Linear Map
:PROPERTIES:
:CUSTOM_ID: h-71c23010-fe29-4e48-81df-2f1488f3e34b
:END:

*** Matrix of Dual of Linear Map
:PROPERTIES:
:CUSTOM_ID: h-29daf0bd-958f-47a7-9eaf-ad0231f6dfa4
:END:

* Chapter 4 Polynomials
:PROPERTIES:
:CUSTOM_ID: h-15a894da-e1d1-4892-8178-5084dae51937
:END:

* Chapter 5 Eigenvalues and Eigenvectors
:PROPERTIES:
:CUSTOM_ID: h-a5f35b0d-df10-4921-bfa4-e615dbcf9e84
:END:

* Chapter 6 Inner Product Spaces
:PROPERTIES:
:CUSTOM_ID: h-d5d9e9a6-eb68-40d8-bc4b-4203c74bab62
:END:

* Chapter 7 Operators on Inner Product Spaces
:PROPERTIES:
:CUSTOM_ID: h-6c414f25-c9cb-49a3-acf8-43ae9f084ef1
:END:

* Chapter 8 Operators on Complex Vector Spaces
:PROPERTIES:
:CUSTOM_ID: h-aa05e670-151b-4aaa-8c9f-0bcc7b17383f
:END:

* Chapter 9 Multilinear Algebra and Determinants
:PROPERTIES:
:CUSTOM_ID: h-5af71d4d-ab0d-4533-8f23-a528d4fb3356
:END:
